blogs/the-frog-in-the-hotel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-03 Fri 03:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Frog in the Hotel</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/styles/dialogue.css" /><link rel="stylesheet" type="text/css" href="/styles/footers.css" /><link rel="stylesheet" type="text/css" href="/styles/monospace.css" /><link rel="stylesheet" type="text/css" href="/styles/window.css" /><link rel="stylesheet" type="text/css" href="/styles/zenburn.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">The Frog in the Hotel</h1>
<p>
It was a sunny day when two friends, Georg and David, were overheard having a conversation:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Georg</td>
<td class="org-left">Why David, you seem troubled today - are those guests of yours being difficult again?</td>
</tr>

<tr>
<td class="org-left">David</td>
<td class="org-left">No- well, yes. But it isn't about accomodation this time.</td>
</tr>

<tr>
<td class="org-left">Georg</td>
<td class="org-left">Oh?</td>
</tr>

<tr>
<td class="org-left">David</td>
<td class="org-left">You see, one of the guests has brought a frog into the hotel.</td>
</tr>

<tr>
<td class="org-left">Georg</td>
<td class="org-left">A <i>frog</i>?</td>
</tr>

<tr>
<td class="org-left">David</td>
<td class="org-left">Yes, and it has caused quite a scene. You see, this species of frog never rests, and it's known for breaking the constraints of space-time as it travels. Each minute, the frog performs its quantum leap, passing through any barriers in its way.</td>
</tr>

<tr>
<td class="org-left">Georg</td>
<td class="org-left">I see, so each minute, the frog moves into a new room?</td>
</tr>

<tr>
<td class="org-left">David</td>
<td class="org-left">That is correct. Curiously, these creatures cannot control their powers, as each leap takes them a fixed distance forward. Nor can they adjust their direction - once they are born, they remain facing the same way until the end of time.</td>
</tr>

<tr>
<td class="org-left">Georg</td>
<td class="org-left">Who would bring such a creature into a hotel! So I take it that you are trying to retrieve this frog?</td>
</tr>

<tr>
<td class="org-left">David</td>
<td class="org-left">Not only that, but we would also like to figure out the culprit behind this mess.</td>
</tr>

<tr>
<td class="org-left">Georg</td>
<td class="org-left">That makes sense.</td>
</tr>

<tr>
<td class="org-left">David</td>
<td class="org-left">Oh, there's one more thing.</td>
</tr>

<tr>
<td class="org-left">Georg</td>
<td class="org-left">Yes?</td>
</tr>

<tr>
<td class="org-left">David</td>
<td class="org-left">Since we last met, we've decided to expand the hotel. We have basement levels now, with room numbers \(-1\), \(-2\), and so on.</td>
</tr>

<tr>
<td class="org-left">Georg</td>
<td class="org-left">Why, that isn't an expansion at all!</td>
</tr>

<tr>
<td class="org-left">David</td>
<td class="org-left">I see you're as sharp as always, Georg.</td>
</tr>
</tbody>
</table>

<p>
Fortunately for David, his friend Georg was indeed sharp, and the frog was found in finite time. After the fact, they were also able to deduce the original time and location the frog was released. Unfortunately for the pair, the frog disappeared within a minute, and the two set off once more&#x2026;
</p>

<hr />

<p>
<b>Author's note:</b>
</p>

<p>
This story was inspired by a puzzle posted on a discord server, with the exact wording below:
</p>

<p>
<i>Suppose that there is a number line of the integers, and there is a frog on an unknown (integer) position \(a\) on the line. Each second (\(t=0,1,\ldots\)), the frog jumps to the right by \(u\) steps (or left by \(u\) steps if \(u\) is negative). At each second (\(t=0,1,\ldots\)), you can choose \(q\) and check whether the frog is at position \(q\).</i>
<i>Prove that you can recover (\(a, u\)) in finite time.</i>
</p>

<p>
It also seems to be related to this puzzle posted on <a href="https://math.stackexchange.com/questions/1085980/puzzle-give-an-algorithm-for-finding-a-frog-that-jumps-along-the-number-line">maths stack exchange</a>, on which someone has commented that <i>"This sounds like a (Martin Gardner?) problem I have heard before, only that one involved bombing a submarine instead of findind(sic) a frog."</i>. Welp, I guess it's time to finish off my blog post on Gardiner puzzles&#x2026;
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-11-03 Fri 00:00</p>
<p class="date">Created: 2023-11-03 Fri 03:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>